# Pandas  (Panel Data)

In [4]:
import pandas as pd

# Series

In [5]:
# Creating empty series
d =pd.Series()

C:\Users\sagar\AppData\Local\Temp/ipykernel_12044/691460501.py:2: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  d =pd.Series()

In [6]:
d

Series([], dtype: float64)

In [7]:
#Creat series with one element
d=pd.Series(17)

In [8]:
d

0    17
dtype: int64

In [9]:
#Creat series using tupple
t = (10,11,12)
d = pd.Series(t)
d

0    10
1    11
2    12
dtype: int64

In [10]:
#Creat series using list
d = pd.Series([45,56,67,78])
d

0    45
1    56
2    67
3    78
dtype: int64

In [11]:
#Creat series using array
import numpy as np
arr =np.array([12,23,34,45,56,67])
d = pd.Series(arr)
d

0    12
1    23
2    34
3    45
4    56
5    67
dtype: int32

In [12]:
#Using dictionary
d = {'a':1, 'b':2, 'c':3, 'd':4}
b=pd.Series(d)
b

a    1
b    2
c    3
d    4
dtype: int64

In [13]:
arr_2 = np.array([1,2,3])
s_2 = pd.Series(arr_2, index=['one', 'two', 'one'])
s_2

one    1
two    2
one    3
dtype: int32

In [14]:
type(s_2)

pandas.core.series.Series

In [15]:
b

a    1
b    2
c    3
d    4
dtype: int64

In [16]:
#Access the data
b[3]

4

In [17]:
b['a']

1

In [18]:
s_2['two']

2

In [19]:
d['b']

2

In [20]:
#Slicing operation
d = pd.Series([1,2,3,5,56,67,7,8,54,34,187,8,9,10,65,376,289])

In [21]:
d[0:9]

0     1
1     2
2     3
3     5
4    56
5    67
6     7
7     8
8    54
dtype: int64

In [22]:
d[0:14:2]

0       1
2       3
4      56
6       7
8      54
10    187
12      9
dtype: int64

In [23]:
d[[4,5,6,3]]    #Multiple index

4    56
5    67
6     7
3     5
dtype: int64

In [24]:
d[4]= 34   #chaging element

In [25]:
d[4]

34

# DataFrame

In [26]:
## Empty dataframe
d=pd.DataFrame()

In [27]:
d

Empty DataFrame
Columns: []
Index: []

In [28]:
print(d)

Empty DataFrame
Columns: []
Index: []

In [29]:
#Nested list
data = [[1,2,3,4], [12,24,1,'a',8],[7,8,9]]

In [30]:
d = pd.DataFrame(data)
d

    0   1  2     3    4
0   1   2  3     4  NaN
1  12  24  1     a  8.0
2   7   8  9  None  NaN

In [31]:
data = [['abc',1],['def',2],['ghi',3],['jkl',],['mno',5]]
d = pd.DataFrame(data)      
d

     0    1
0  abc  1.0
1  def  2.0
2  ghi  3.0
3  jkl  NaN
4  mno  5.0

In [32]:
data = [['abc',1],['def',2],['ghi',3],['jkl',],['mno',5]]
d = pd.DataFrame(data, columns=['A','B'])       #changing the column
d

     A    B
0  abc  1.0
1  def  2.0
2  ghi  3.0
3  jkl  NaN
4  mno  5.0

In [33]:
# Used to rename index of dataframe
d= pd.DataFrame(data, index=['A','B','C','D','E'])
d

     0    1
A  abc  1.0
B  def  2.0
C  ghi  3.0
D  jkl  NaN
E  mno  5.0

In [34]:
# dataframe using dictionary
data1 = {'name':['a','b','c','d','e','f'], 'age':[45,35,46,23,24,17]}

d=pd.DataFrame(data1)
d

  name  age
0    a   45
1    b   35
2    c   46
3    d   23
4    e   24
5    f   17

In [36]:
#Change the name of the column while defining the 
d.rename({'name':'Name', 'age':'Age'}, axis=1)

  Name  Age
0    a   45
1    b   35
2    c   46
3    d   23
4    e   24
5    f   17

In [37]:
d

  name  age
0    a   45
1    b   35
2    c   46
3    d   23
4    e   24
5    f   17

In [38]:
d.rename({'name':'Name', 'age':'Age'}, axis=1, inplace=True)
d

  Name  Age
0    a   45
1    b   35
2    c   46
3    d   23
4    e   24
5    f   17

In [39]:
#Accessing the elements from dataframe
data = [['ALex',10,'Maths'],['Bob',12,'Science'],['Kelly',15,'Eco'],['Boris',14,'Geo'],
        ['Ken',18,'English']]

In [53]:
d= pd.DataFrame(data, columns=['Name','Age','Subject'])
d

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [54]:
d['Name']

0     ALex
1      Bob
2    Kelly
3    Boris
4      Ken
Name: Name, dtype: object

In [55]:
d[['Name', 'Subject']]

    Name  Subject
0   ALex    Maths
1    Bob  Science
2  Kelly      Eco
3  Boris      Geo
4    Ken  English

In [56]:
d.iloc[:,[0,1]]    #index location

    Name  Age
0   ALex   10
1    Bob   12
2  Kelly   15
3  Boris   14
4    Ken   18

In [57]:
d.iloc[1:3,0:3]

    Name  Age  Subject
1    Bob   12  Science
2  Kelly   15      Eco

In [58]:
d

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [59]:
## To access single element we use iloc
d.iloc[0,2]   #index of row, columns

'Maths'

In [62]:
## loc will work on rows as well as name if the columns
d.loc[:, ['Name','Subject']]

    Name  Subject
0   ALex    Maths
1    Bob  Science
2  Kelly      Eco
3  Boris      Geo
4    Ken  English

In [64]:
d.loc[:, 'Name']

0     ALex
1      Bob
2    Kelly
3    Boris
4      Ken
Name: Name, dtype: object

In [65]:
d.loc[3]   #Getting the rows

Name       Boris
Age           14
Subject      Geo
Name: 3, dtype: object